<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [158]:
import pandas as pd
import psycopg2

In [159]:
#Параметры подключения из юнита 1. Работа с базой данных из Python
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [160]:
connection = psycopg2.connect(
   dbname=DBNAME,
   user=USER,
   host=HOST,
   password=PASSWORD,
   port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [161]:
n = 10
#Выводим первые 10 строк таблицы Vacancies для информации
query = f'''select *
            from vacancies
            limit {n}
'''
df = pd.read_sql_query(query, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/4058763088.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
5,55906072,Корректор,Корректура текстов\tГрамотность\tРабота в кома...,Полный день,Нет опыта,Полная занятость,NaN,NaN,2323,584934
6,55523207,React Front-end Middle Developer,JavaScript\tTypeScript\tCSS3\tNode.js\tHTML5,Гибкий график,От 1 года до 3 лет,Полная занятость,NaN,NaN,2759,204511
7,55050261,Инженер-программист,Java SE\tSpring Framework\tSpring Boot\tGit\tS...,Полный день,Нет опыта,Полная занятость,40000.0,60000.0,49,4448636
8,55583432,Системный администратор,Linux\tАдминистрирование сетевого оборудования...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,NaN,3,55126
9,55312414,Ведущий специалист группы разработки систем,1С программирование\t1С: Предприятие 8\t1С: До...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,47,1413754

In [162]:
#Посчитаем количество вакансий с помощью count из таблицы Vacacies столбец Name
query3_1 = f'''select count(name)
            from vacancies
'''

In [163]:
#Выводим результат
df = pd.read_sql_query(query3_1, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2886869785.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [164]:
n = 10
#Выводим 10 строк таблицы Employers для информации
query = f'''select *
            from employers
            limit{n}
'''
df = pd.read_sql_query(query, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/3194180158.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

In [165]:
#Посчитаем количество работодателей с помощью count из таблицы Employers столбец Name
query3_2 = f'''select count(name)
            from employers
'''

In [166]:
#Выводим результат
df = pd.read_sql_query(query3_2, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2481331826.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [167]:
n = 10
#Выводим 10 строк таблицы Areas для информации
query = f'''select *
            from areas
            limit{10}
'''
df = pd.read_sql_query(query, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/3540570861.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

        id              name
0     2758           Тбилиси
1        8            Майкоп
2     1180          Нерюнгри
3     1240       Новокузнецк
4        2   Санкт-Петербург
...    ...               ...
1357  5043  Звёздный Городок
1358  3934       Воротынск\n
1359  4825             Чемал
1360  3708         Усть-Нера
1361  2432         Каневская

[1362 rows x 2 columns]

In [168]:
#Посчитаем количество регионов с помощью count из таблицы Areas столбец Name
query3_3 = f'''select count(name)
               from areas
'''

In [169]:
#Выводим результат
df = pd.read_sql_query(query3_3, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/3576613639.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [170]:
n = 10
#Выводим 10 строк таблицы Industries для информации
query = f'''select *
            from industries
            limit{n}
'''
df = pd.read_sql_query(query, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/1844749668.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

          id                                               name
0      7.540                Разработка программного обеспечения
1      7.539  Системная интеграция,  автоматизации технологи...
2     27.550              Безалкогольные напитки (производство)
3     27.551  Безалкогольные напитки (продвижение, оптовая т...
4     13.664             Управление и эксплуатация недвижимости
..       ...                                                ...
289   37.626             Ассоциация в сфере культуры, искусства
290   42.603                              Табак  (производство)
291   29.532                           Рыболовство, рыбоводство
292   37.627                      Благотворительная организация
293  388.505  Оборудование для деревообработки, заготовки ле...

[294 rows x 2 columns]

In [171]:
#Посчитаем количество сфер деятельности с помощью count из таблицы Industries столбец Name
query3_4 = f'''select count(name)
            from industries
'''

In [172]:
#Выводим результат
df = pd.read_sql_query(query3_4, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/1159194144.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query3_4, connection)

   count
0    294

Кадровому агенству необходимо подобрать вакансии для IT-специалистов, для этого необходимо создать модель машинного обучения, рекомендующая вакансии клиентам агентства, претендующим на позицию Data Scientist.
Для предварительного анализа данных рассмотрим предоставленные таблицы: Vacacies - хранит в себе данные по вакансиям(ID вакансии, название вакансий, ключевые навыки, тип рабочего графика, требования к опыту работы, тип трудоустройства, нижняя граница заработной вилки, верхняя граница заработной вилки, ID региона вакансии, ID работодателя); Areas - справочник, хранит код региона и его название (связана с Таблицей Vacancies по ключам ID (Идентификатор города) и area_id (ID региона вакансии)); Employers - справочник, хранит номер работодателя, название работодателя и регион регистраци (связана с тоблиций Vacancies по ключам employer_id (Идентификатор работодателя) и ID (номер работодателя)); Industries - справочник, хранит ID сферы деятельности и название сферы деятельности (связана с таблицей Industries_Employers по ключам ID (ID сферы деятельности) и industry_id (ID сферы деятельности)); Industries_Emplloyers - дополнительная таблица, связывающая между собой таблицы Industries и Employers, хранит ID работодателя и ID сферы деятельности.
В данном блоке провели подсчет количества вакансий, регионов, работодателей и сфер деятельности.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [173]:
#вводим названия столбцов с которыми будем работать: a.name - название городов из таблицы Area
#за основу берем таблицу Vacancies и присоедим к ней таблицу Area по ключам v.area_id - идентификатор региона вакансии из таблицы Vacancies и a.id - идентификатор города
#сгруппируем данные по названиям городов, отсортируем по количеству вакансий в убывающем порядке и выведем пятерку лидеров
query4_1 = f'''select a.name "Название города", count(*) "Количество вакансий"
            from vacancies v 
            join areas a on v.area_id = a.id
            group by a.name
            order by 2 desc
            limit 5
'''

In [174]:
#Выводим результат
df = pd.read_sql_query(query4_1, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2258319470.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query4_1, connection)

   Название города  Количество вакансий
0           Москва                 5333
1  Санкт-Петербург                 2851
2            Минск                 2112
3      Новосибирск                 2006
4           Алматы                 1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [175]:
#вводим count(name) для подсчета количества вакансий. за основу берем таблицу Vacancies.
#прописываем условие фильтрации по столбцам salary_from и salary_to, где указываем, что либо одно из значений было заполнено, либо оба столбца были заполнены
query4_2 = f'''select count(name)
            from vacancies 
            where salary_from is not Null or salary_to is not Null or (salary_from is not Null and salary_to is not Null)
'''

In [176]:
#Выводим результат
df = pd.read_sql_query(query4_2, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2241969536.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [177]:
#для подсчета среднего значения используем функцию avg, в которой прописываем параметр по которому необходимо произвести расчет: salary_from и salary_to
#для округления полученного значения применим функцию round
#за основу берем таблицу Vacancies
#в условии фильтрации прописываем условие, что значения верхней и нижней границы зп заполнены
query4_3 = f'''select round(avg(salary_from)) avg_salary_from, round(avg(salary_to)) avg_salary_to
            from vacancies 
            where salary_from is not Null
            or salary_to is not Null
'''

In [178]:
#Выводим результат
df = pd.read_sql_query(query4_3, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2626253104.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query4_3, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [179]:
#зададим параметры для запроса: для подсчета названий вакансий, тип рабочего графика, тип трудоустройства
#за основу берем таблицу Vacancies
#группируем по названию вакансии, типу рабочего графика и типу трудоустройства
#прописываем условие сортировки: по количеству вакансий, типу рабочего графика и типу трудоустройства
#для выполнения условия задания необходимо удалить первую строку в итоговом результате запроса, для получения второй по популярности вакансии
query4_4 = f'''select count(name) "Название вакансии", schedule "Тип рабочего графика", employment "Тип трудоустройства"
            from vacancies  
            group by name, schedule, employment
            order by name desc, schedule, employment 
            offset 1 limit 1
'''

In [180]:
#Выводим результат
df = pd.read_sql_query(query4_4, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2680040261.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query4_4, connection)

   Название вакансии Тип рабочего графика Тип трудоустройства
0                  3     Удаленная работа    Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [181]:
#для информации выведем уникальные названия требуемого опыта работы, берем данные из таблицы Vacancies
#группируем по столбцу опыт работы
#сортируем по столбцу опыт работы
query = f'''select distinct experience "Требуемый опыт работы"
            from vacancies 
            group by experience
            order by experience 
'''

In [182]:
#Выводим результат
df = pd.read_sql_query(query, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/3184723198.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

  Требуемый опыт работы
0           Более 6 лет
1             Нет опыта
2    От 1 года до 3 лет
3         От 3 до 6 лет

In [183]:
##зададим параметры для запроса: для подсчета названий вакансий, требуемый опыт работы
#за основу берем таблицу Vacancies
#группируем по названию вакансий и требуемого опыта работы
#сортируем по опыту работы в возрастающем порядке и количеству вакансий в возрастающем порядке
query4_5 = f'''select count(name) "Количество вакансий", experience "Требуемый опыт работы"
            from vacancies 
            group by name, experience
            order by experience asc, name asc
            limit 10
'''

In [184]:
#Выводим результат
df = pd.read_sql_query(query4_5, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/2957679890.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query4_5, connection)

   Количество вакансий Требуемый опыт работы
0                    1           Более 6 лет
1                    1           Более 6 лет
2                    1           Более 6 лет
3                    1           Более 6 лет
4                    1           Более 6 лет
5                    1           Более 6 лет
6                    1           Более 6 лет
7                    1           Более 6 лет
8                    1           Более 6 лет
9                    1           Более 6 лет

***

В данной части проекта изучили регионы-лидеры по количеству вакансий на позицию Data Scientist, вычислили средние показатели верхней и нижней границ заработной платы, количество вакансий для различного вида сочетаний типов рабочего графика и трудоустройства, вывели зависимость количества вакансий от опыта работы.
Исходя из запроса можно сделать вывод, что наибольшее число вакансий находятся в крупных городах или в городах/регионах с крупным производством, это связано с большими возможностями крупных фирм/предриятий, также с необходимостью этих предприятий/фирм работать с большим объемом данных, которые необходимо структурировать и проанализировать.
Также мы видим, что уровень заработной платы достаточно высокий для данного вида вакансий, такую оплату труда могут обеспечить только в крупных городах и предприятиях/фирмах.
В большинстве вакансий требуются сотрудники с опытом работы от 1 года до 6 лет, скорее всего это связано с большой текучестью кадров, либо связано с быстрым карьерным ростом.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [185]:
#для выполнения данного запроса возьмем наименование работодателя(из таблицы Employers), для подсчета вакансий используем функцию count из таблицы Vacancies
#объединим таблицы Vacancies и Employers по ключам v.employer_id и e.id
#группируем по названию работодателя, сортируем по количеству вакансий в убывающем порядке
#выводим пятерку лидеров
query5_1 = f'''select e.name "Название работодателя", count(*) "Количество вакансий"
            from vacancies v
            join employers e on v.employer_id = e.id
            group by e.name
            order by 2 desc
            limit 5
'''

In [186]:
#Выводим результат
df = pd.read_sql_query(query5_1 connection)
df

SyntaxError: invalid syntax. Perhaps you forgot a comma? (1453400182.py, line 2)

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [ ]:
#зададим параметры для вывода запроса: наимнование региона, используя функцию count посчитаем количество вакансий и работодателей
#к основной таблице Areas присоединим таблицы Employers по ключам e.area и a.id и Vacancies - v.area_id и a.id
#добавим условие для фильтрации, где количество вакансий 0
#сгруппируем данные по наименованию региона, отсортируем данные по количеству работодателей в убывающем порядке
#выведем первую строку результата
query5_2 = f'''select a.name as area, count(v.id) as cnt_vacancies, count(e.id) as cnt_employers
            from areas as a
            left join employers as e on e.area = a.id
            left join vacancies as v on v.area_id = a.id
            where v.id is null
            group by a.name
            order by 3 desc
            limit 1
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query5_2, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     area  cnt_vacancies  cnt_employers
0  Россия              0            410

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [ ]:
#для запроса введем данные: наименование работодателя, количество уникалных названий региона
#за основу возмем таблицы: Employers, Vacancies, Areas
#пропишем условие фильтрации по ключам ID региона вакансии из таблицы Vacancies и индентификатор города из таблицы Areas, а также ID работодателя из таблицы Vacancies и номер работодателя из таблицы Employers
#группируем данные по названию работодателя, сортируем по региону в убывающем порядке
#выводим первую строку 
query5_3 = f'''select e.name employers, count(distinct v.area_id) area
            from employers e, vacancies v, areas a
            where v.area_id = a.id and v.employer_id = e.id
            group by e.name
            order by area desc
            limit 1
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query5_3, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

  employers  area
0    Яндекс   181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [ ]:
#задаем переменную для подсчета количества работодателей
#за основу берем таблицу Employers соединим ее с таблицей Employers_Industries по ключам e.id и ei.employer_id
#пропишем условие фильтрации, где укажем,что Сфера деятельности не заполнена. Данные берем из таблицы Employers_Industries
query5_4 = f'''select count(e.name)
            from employers e 
            left join employers_industries ei on e.id = ei.employer_id
            where ei.employer_id is null
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query5_4, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [ ]:
#задаем переменную название компании. За основу примем таблицу Employers
#соединим ее с таблицей Employers_Industries по ключам e.id и ei.employer_id
#сгруппируем данные по номеру работодателя
#отфильтруем по условию, где число сфер деятельности равно 4
#отсортируем по названию компании в алфавитном порядке
#для получения третьего места в списке удалим первые 2 строки и выведем первую строку после удаления
query5_5 = f'''select name 
            from employers e  
            left join employers_industries ei on e.id = ei.employer_id  
            group by e.id 
            having count(ei.industry_id) = 4 
            order by name 
            offset 2 limit 1 
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query5_5, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
#зададим переменную для подсчета количества работодателей. За основу возьмем таблицу Employers
#соедним ее с таблицами Employers_Industries и Industries по ключам e.id и ei.employer_id, i.industry_id и i.id
#сгруппируем по названию сферы деятельности, также отфильтруем по условию, где название сферы деятельности - Разработка программного обеспечения
query5_6 = f'''select count(e.name)
            from employers e  
            join employers_industries ei on e.id = ei.employer_id  
            join industries i on ei.industry_id = i.id
            group by i.name 
            having i.name LIKE 'Разработка программного обеспечения'
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query5_6, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
query5_7 = f'''WITH temp AS(
            select a.name,
            COUNT (*) cnt
            FROM vacancies v
            LEFT JOIN areas a ON a.id = v.area_id
            LEFT JOIN employers e ON e.id = v.employer_id
            WHERE e.name = 'Яндекс'
            AND a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Краснодар', 'Воронеж', 'Пермь', 'Волгоград', 'Омск')
            GROUP BY 1
            ORDER BY 2
)
            SELECT *  FROM temp
            UNION ALL
            SELECT 'Total', sum(cnt)  
            FROM temp
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query5_7, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7               Уфа   26.0
8            Самара   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

***

В данном блоке мы более детально рассмотрели работодателей. Наибольшее число вакансий разместила компания Яндекс, это связано с огромным спектром услуг, которые предлагает компания: услуги доставки, маркетплейс, курьеры, такси. Для поддержания жизнедеятельности такой крупной компании необходимы специалисты по Data Science. В пятерку лидеров по числу вакансий также выходят такие высокотехнологичные компание как Ростелеком, Тинькоф, СБЕР, Газпром нефть. Наибольшее число вакансий находятся в крупных-городах, таких как Москва, Санкт-Петербург, Новосибирск, Казань, Самара, Уфа, Волгоград, Ростов-на-Дону, Челябинск, Омск, Краснодар, Нижний Новгород, Воронеж,Екатеринбург, Красноярск. Это связано с тем, что в этих регионах очень много крупных компаний, которым необходимы специалисты по работе с данными.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [ ]:
#за основы возьмем таблицу Vacancies, столбец наименование вакансии, спомощью функции count посчитаем число вакансий
#отфильтруем с помощью функции ILIKE(не чувствительна к регистру) ваккансии в которых встречаются
#ключевае слова "данн" и "data"
query6_1 = f'''select count(v.name)
            from vacancies v
            where (name ILIKE '%data%') or (name ILIKE '%данн%')
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query6_1, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [ ]:
#за основу берем таблицу Vacancies, подсчитаем количество вакансий
#отфильтруем с помощью функции ILIKE по ключевым словам, которые встречаются в запросе 
#'data scientist','data science',исследователь данных','ML' (здесь не нужно брать вакансии по HTML),'machine learning','машинн%обучен%'
#'junior', опыт работы по ключу 'нет опыта', тип трудоустройства -  'стажировка'
query6_2 = f'''select count(v.name)
            from vacancies v
            where ((name ILIKE '%data scientist%')
            or (name ILIKE '%data science%')
            or (name ILIKE '%исследователь данных%')
            or (name ILIKE '%machine learning%')
            or (name ILIKE '%машинн%обучен%')
            or (name ILIKE '%ML%' and name NOT ILIKE '%HTML%'))
            and ((name ILIKE '%junior%' 
                or experience = 'Нет опыта'
                or employment = 'Стажировка'))
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query6_2, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [ ]:
#за основу берем таблицу Vacancies, подсчитаем количество вакансий
#отфильтруем с помощью функции ILIKE и NOT ILIKE по ключевым словам, которые встречаются в запросе 
#'data scientist','data science',исследователь данных','ML' (здесь не нужно брать вакансии по HTML),'machine learning','машинн%обучен%'
#ключевые навыки по ключевым словам 'SQL' 'Postgres'
query6_3 = f'''select count(v.name)
            from vacancies v
            where ((name ILIKE '%data scientist%')
            or (name ILIKE '%data science%')
            or (name ILIKE '%исследователь данных%')
            or (name ILIKE '%machine learning%')
            or (name ILIKE '%машинн%обучен%')
            or (name ILIKE '%ML%' and name NOT ILIKE '%HTML%'))
            and (v.key_skills ILIKE '%SQL%' or v.key_skills ILIKE 'Postgres')
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query6_3, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [ ]:
#за основу берем таблицу Vacancies, подсчитаем количество вакансий
#отфильтруем с помощью функции ILIKE и NOT ILIKE по ключевым словам, которые встречаются в запросе 
#'data scientist','data science',исследователь данных','ML' (здесь не нужно брать вакансии по HTML),'machine learning','машинн%обучен%'
#ключевые навыки по ключевым словам 'Python'
query6_4 = f'''select count(v.name)
            from vacancies v
            where ((name ILIKE '%data scientist%')
            or (name ILIKE '%data science%')
            or (name ILIKE '%исследователь данных%')
            or (name ILIKE '%machine learning%')
            or (name ILIKE '%машинн%обучен%')
            or (name ILIKE '%ML%' and name NOT ILIKE '%HTML%'))
            and (v.key_skills ILIKE '%Python%')
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query6_4, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
#за основу берем таблицу Vacancies, подсчитаем среднее число навыков
#с помощью функции avg, за основу возьмем длину строки key_skills с помощью функции Length
#c помощью функци replace заменим символы табуляции CHR9, к найденным разделителям прибавим 1, так как
#параметров всегда на один больше, чем разделителей
#отфильтруем с помощью функции ILIKE и NOT ILIKE по ключевым словам, которые встречаются в запросе 
#'data scientist','data science',исследователь данных','ML' (здесь не нужно брать вакансии по HTML),'machine learning','машинн%обучен%'
query6_5 = f'''select round(avg(length(key_skills) - length(replace(key_skills, CHR(9), ''))+1), 2) as skills_avg
            from public.vacancies 
            where key_skills is not null 
            and (name ILIKE '%data scientist%'
            or name ILIKE '%data science%'
            or name ILIKE '%исследователь данных%'
            or name ILIKE '%machine learning%'
            or name ILIKE '%машинн%обучен%'
            or (name LIKE '%ML%' and name NOT LIKE '%HTML%'))
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query6_5, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   skills_avg
0        6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [ ]:
#за основу берем таблицу Vacancies, с помощью функций round, avg, coalesce (позволяет заменить Null на 0)
#отфильтруем с помощью функций ILIKE и NOT ILIKE по ключевым словам, которые встречаются в запросе 
#'data scientist','data science',исследователь данных','ML' (здесь не нужно брать вакансии по HTML),'machine learning','машинн%обучен%'
#пропишем условие, что salary_from is not null или salary_to is not null
#сгруппируем по опыту работы, отсортируем по 2 столбцу итогового запроса
query6_6 = f'''select experience,
                round(avg(coalesce((salary_from + salary_to)/2, salary_from, salary_to)), 0)
            from vacancies 
            where (name ILIKE '%data science%' 
            or name ILIKE '%data science%'
            or name ILIKE '%исследователь данных%'
            or name ILIKE '%machine learning%'
            or name ILIKE '%машинн%обучен%'
            or (name ILIKE '%ML%' and name NOT ILIKE '%HTML%'))
            and (salary_from is not null
            or salary_to is not null)
            group by experience
            order by 2 desc
'''

In [ ]:
#Выводим результат
df = pd.read_sql_query(query6_6, connection)
df

/var/folders/t4/2c1dwf9x4l541yz0rxj10dk80000gn/T/ipykernel_57904/137330334.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience     round
0       От 3 до 6 лет  265538.0
1         Более 6 лет  157933.0
2  От 1 года до 3 лет  144141.0
3           Нет опыта  115000.0

***

В данном блоке мы изучили требования к соискателям, претендующим на должность, а также выявили зависимость уровня заработной платы от опыта работы. Чем больше трудовой стаж, тем выше уровень заработной платы.
Также выявили, что Python, SQL и Postgres очень популярны среди ключевых навыков. Владение этими программами очень помогает в работе с большим объемом данных, с которым сталкиваются специалисты Data Science.

# Общий вывод по проекту

Кадровому агенству необходимо подобрать вакансии для IT-специалистов, для этого необходимо создать модель машинного обучения, рекомендующая вакансии клиентам агентства, претендующим на позицию Data Scientist.
В ходе анализа данных рассмотрели предоставленные таблицы: Vacacies, Areas, Employers, Industries_Employers, Employers.
Подводя итоги, можно сделать следующие выводы.
Специалисты в данной сфере весьма востребованы на рынке труда, однако даннпя вакансия популярна пока что в крупных городах. Это связано с большей концентрацией крупных предприятий/фирм в городах-миллионниках, а также с высокими требованиями к оплате труда, что могут позволить исключительно крупные компании. Также к соискателям предъявлены высокие требования к знаниям, необходимо владение такими программами как Python, SQL и Postgres.
На мой взгляд, количество соискателей будет расти, это связано с высокой скоростью развития технологических процессов (искуственный интеллект), за этими процессами необходимо следить, выявлять отклонения в работе и очень быстро реагировать на них.